infrastructure/experiments/haproxy_ab/roundrobin-1/ab_10000_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient)


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2688 bytes

Concurrency Level:      1000
Time taken for tests:   31.340 seconds
Complete requests:      10000
Failed requests:        9431
   (Connect: 0, Receive: 0, Length: 9431, Exceptions: 0)
Non-2xx responses:      302
Total transferred:      27992734 bytes
HTML transferred:       26196894 bytes
Requests per second:    319.08 [#/sec] (mean)
Time per request:       3134.000 [ms] (mean)
Time per request:       3.134 [ms] (mean, across all concurrent requests)
Transfer rate:          872.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9  25.3      1     121
Processing:    30 2540 5088.7   1349   31191
Waiting:       16 2540 5088.7   1348   31191
Total:         32 2548 5103.4   1352   31309

Percentage of the requests served within a certain time (ms)
  50%   1352
  66%   1454
  75%   1532
  80%   1643
  90%   2598
  95%   4852
  98%  30243
  99%  30271
 100%  31309 (longest request)
