infrastructure/experiments/haproxy_ab/roundrobin-1/ab_100_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2708 bytes

Concurrency Level:      10
Time taken for tests:   0.329 seconds
Complete requests:      100
Failed requests:        86
   (Connect: 0, Receive: 0, Length: 86, Exceptions: 0)
Total transferred:      288538 bytes
HTML transferred:       270338 bytes
Requests per second:    304.07 [#/sec] (mean)
Time per request:       32.887 [ms] (mean)
Time per request:       3.289 [ms] (mean, across all concurrent requests)
Transfer rate:          856.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.2      1       2
Processing:    16   26   9.4     23      69
Waiting:       16   26   9.4     23      69
Total:         17   27   9.5     24      70

Percentage of the requests served within a certain time (ms)
  50%     24
  66%     26
  75%     28
  80%     29
  90%     42
  95%     53
  98%     59
  99%     70
 100%     70 (longest request)
